# ENADID 1992

In [244]:
import os

folder_path = "data\\fd_enadid92"

files = os.listdir(folder_path)

files_to_work = []
for f in files:
    if f.endswith('.xlsx'):
        files_to_work.append(f)

In [245]:
import pandas as pd

enadid_dfs = []
for w in files_to_work:
    path_file = os.path.join(folder_path, w)
    enadid_dfs.append(pd.read_excel(path_file))

dtest = enadid_dfs[0]

In [246]:
categories = ['CAMPO','PREGUNTA', 'CÓDIGO', 'DESCRIPCIÓN DE CÓDIGOS']
dcols = list(dtest.columns)
subset_cols = [-1]
for cat in categories:
    subset_cols.append(dcols.index(cat))
subset_cols.append(len(dcols))


subcols = []
for i in range(len(subset_cols) - 1):
    subcols.append(dcols[subset_cols[i] + 1: subset_cols[i + 1] + 1])


subdfcols = []
for g in subcols:
    subdfcols.append(dtest[g])

In [247]:
import numpy as np

k = 0
df_k = subdfcols[k].copy()
m_k = len(df_k)
n_k = len(df_k.columns)
campo = list(df_k['CAMPO'].isna())

i = 0
select = [df_k.iloc[i,1:].isna().sum(axis = 0) for i in range(m_k)]
all_na = np.array(select).max()
for i in range(m_k):
    df_kna = pd.isna(df_k.iloc[i, -1])
    if df_kna and select[i] < all_na:
        df_ki = df_k.iloc[i, 1:]
        df_na = list(pd.isna(df_ki))
        ina = df_na.index(False)
        v = df_k.iloc[i, ina + 1]
        df_k.iloc[i, ina + 1] = pd.NA
        df_k.iloc[i, -1] = v
dfk = df_k.dropna(axis = 1, how = 'all').ffill()
dfk

    XI  ANTICONCEPCIÓN.\n\nDESCRIPCIÓN    CAMPO
0             CONOCIMIENTO DE MÉTODOS:      NaN
1                            PASTILLAS   P11_1a
2                            PASTILLAS   P11_1a
3                            PASTILLAS   P11_1a
4                            PASTILLAS   P11_1a
..                                 ...      ...
272                                MES  P11_25a
273                                MES  P11_25a
274                                AÑO  P11_25b
275                                AÑO  P11_25b
276                                AÑO  P11_25b

[277 rows x 2 columns]

In [248]:
k = 1
df_k = subdfcols[k].copy()
m_k = len(df_k)
n_k = len(df_k.columns)
df_k

campo = list(df_k['PREGUNTA'].isna())

i = 0
select = [df_k.iloc[i,1:].isna().sum(axis = 0) for i in range(m_k)]
all_na = np.array(select).max()
for i in range(m_k):
    df_kna = pd.isna(df_k.iloc[i, -1])
    if df_kna and select[i] < all_na:
        df_ki = df_k.iloc[i, 1:]
        df_na = list(pd.isna(df_ki))
        ina = df_na.index(False)
        v = df_k.iloc[i, ina + 1]
        df_k.iloc[i, ina + 1] = pd.NA
        df_k.iloc[i, -1] = v
dfk = df_k.dropna(axis = 1, how = 'all').ffill()
dfk

C:\Users\Tamara\AppData\Local\Temp\ipykernel_11752\590401613.py:20: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '28' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df_k.iloc[i, -1] = v

        Unnamed: 14 PREGUNTA
0               NaN      NaN
1               NaN     18.0
2               NaN     18.0
3               NaN     18.0
4               NaN     18.0
..              ...      ...
272  49-68\n\n69-70  197-198
273  49-68\n\n69-70  197-198
274  49-68\n\n69-70  197-198
275  49-68\n\n69-70  197-198
276  49-68\n\n69-70  197-198

[277 rows x 2 columns]

In [249]:
k = 2
df_k = subdfcols[k].copy()
m_k = len(df_k)
n_k = len(df_k.columns)
df_k

campo = list(df_k['CÓDIGO'].isna())

i = 0
select = [df_k.iloc[i,1:].isna().sum(axis = 0) for i in range(m_k)]
all_na = np.array(select).max()
for i in range(m_k):
    df_kna = pd.isna(df_k.iloc[i, -1])
    if df_kna and select[i] < all_na:
        df_ki = df_k.iloc[i, 1:]
        df_na = list(pd.isna(df_ki))
        ina = df_na.index(False)
        v = df_k.iloc[i, ina + 1]
        df_k.iloc[i, ina + 1] = pd.NA
        df_k.iloc[i, -1] = v
dfk = df_k.dropna(axis = 1, how = 'all').ffill()
dfk

    Unnamed: 20 Unnamed: 29 Unnamed: 32 Unnamed: 33 Unnamed: 34   CÓDIGO
0           NaN         NaN         NaN         NaN         NaN      NaN
1           NaN         NaN         NaN         NaN         NaN        1
2           NaN         NaN         NaN         NaN         NaN        2
3           NaN         NaN         NaN         NaN         NaN        3
4           NaN         NaN         NaN         NaN         NaN        b
..          ...         ...         ...         ...         ...      ...
272       98-99          01           1          01       01-12       99
273       98-99          01           1          01       01-12       bb
274       98-99          01           1          01       47-92  233-234
275       98-99          01           1          01       47-92       99
276       98-99          01           1          01       47-92       bb

[277 rows x 6 columns]

In [250]:
k = 3
df_k = subdfcols[k].copy()
m_k = len(df_k)
n_k = len(df_k.columns)
df_k

campo = list(df_k['DESCRIPCIÓN DE CÓDIGOS'].isna())

i = 0
select = [df_k.iloc[i,1:].isna().sum(axis = 0) for i in range(m_k)]
all_na = np.array(select).max()
for i in range(m_k):
    df_kna = pd.isna(df_k.iloc[i, -1])
    if df_kna and select[i] < all_na:
        df_ki = df_k.iloc[i, 1:]
        df_na = list(pd.isna(df_ki))
        ina = df_na.index(False)
        v = df_k.iloc[i, ina + 1]
        df_k.iloc[i, ina + 1] = pd.NA
        df_k.iloc[i, -1] = v
dfk = df_k.dropna(axis = 1, how = 'all').ffill()
dfk

               Unnamed: 37 DESCRIPCIÓN DE CÓDIGOS
0                      NaN                    NaN
1                      NaN   Si (Espontáneamente)
2                      NaN         Si (Con ayuda)
3                      NaN                     No
4                      NaN        No especificado
..                     ...                    ...
272  No\n\nNo especificado        No especificado
273  No\n\nNo especificado               Por pase
274  No\n\nNo especificado                    Año
275  No\n\nNo especificado        No especificado
276  No\n\nNo especificado               Por pase

[277 rows x 2 columns]

In [251]:
k = 4
df_k = subdfcols[k].copy()
m_k = len(df_k)
n_k = len(df_k.columns)
df_k


i = 0
select = [df_k.iloc[i,1:].isna().sum(axis = 0) for i in range(m_k)]
all_na = np.array(select).max()
for i in range(m_k):
    df_kna = pd.isna(df_k.iloc[i, -1])
    if df_kna and select[i] < all_na:
        df_ki = df_k.iloc[i, 1:]
        df_na = list(pd.isna(df_ki))
        ina = df_na.index(False)
        v = df_k.iloc[i, ina + 1]
        df_k.iloc[i, ina + 1] = pd.NA
        df_k.iloc[i, -1] = v
dfk = df_k.dropna(axis = 1, how = 'all').ffill()
dfk

                            Unnamed: 46 Unnamed: 48
0                                   NaN         NaN
1                                   NaN         NaN
2                                   NaN         NaN
3                                   NaN         NaN
4                                   NaN         NaN
..                                  ...         ...
272  Por ausencia temporal de su pareja    Separada
273  Por ausencia temporal de su pareja    Separada
274  Por ausencia temporal de su pareja    Separada
275  Por ausencia temporal de su pareja    Separada
276  Por ausencia temporal de su pareja    Separada

[277 rows x 2 columns]